# SQL

### Sequence of SQL statement (for writing)
>Select

>From

>join

>where

>group by

>having

>order by/ sort by

>limit

### Sequence of SQL query by execution
> From

> Join

> where

> group by

> having

> order by

> limit

> select

### Clauses

#### Select: 
    > to select columns from table/tables
    > to perform different operations on columns
    > to get summary of data by count or aggregations
#### From:
    > to mention the table name from which the columns need to be fetched
#### Join:
    > to join 2 or more tables in different ways
#### Where:
    > To filter in or filter out the records based on different conditions.
#### Group by:
    > to group records on different feature values
    > like grouping emplyees by department
#### Having:
    > felter in or out the groups created using group by.
#### Order by:
    > to order/ sort the result based on column or list of columns by ascending or descending order
#### Limit: 
    >To limit the number of records in resultset

In [2]:
from pyspark.sql import SparkSession
# create a SparkSession
spark = SparkSession.builder.appName("Pyspark aggregation").getOrCreate()

# Create a sample DataFrame
data = [("Alice", "F", 25,'pune',60000)
        , ("Bob", "M", 30,'mumbai',70000)
        , ("Charlie", "M", 35,'mumbai',80000)
        , ("Dave", "M", 40,'pune',45000)
        , ("Eve", "F", 45,'pune',52000)
        , ("Eve", "F", 45,'banglore',52000)
        , ("Eve", "F", 45,'chennai',52000)
       ]
company = [("Interface", "pune", 205,1)
           , ("solsoft", "mumbai", 3000,9)
           , ("infosoft", "pune", 6500,15)
           , ("nosoft", "pune", 32000,18)
           , ("prosoft", "mumbai", 25,1)
           , ("prosoft", "noida", 25,1)
           , ("prosoft", "delhi", 25,1)
            ]
df = spark.createDataFrame(data, ["name", "gender", "age",'city','salary'])
df.createOrReplaceTempView("employee")
df2 = spark.createDataFrame(company, ["cname", "city",'employees', 'years'])
df2.createOrReplaceTempView("companies")

def run_query(q):
    spark.sql(q).show()
df.show()

23/04/02 01:39:04 WARN Utils: Your hostname, confabsol7-Lenovo-ideapad-330-15IKB resolves to a loopback address: 127.0.1.1; using 192.168.1.36 instead (on interface wlp3s0)
23/04/02 01:39:04 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

23/04/02 01:39:08 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

+-------+------+---+--------+------+
|   name|gender|age|    city|salary|
+-------+------+---+--------+------+
|  Alice|     F| 25|    pune| 60000|
|    Bob|     M| 30|  mumbai| 70000|
|Charlie|     M| 35|  mumbai| 80000|
|   Dave|     M| 40|    pune| 45000|
|    Eve|     F| 45|    pune| 52000|
|    Eve|     F| 45|banglore| 52000|
|    Eve|     F| 45| chennai| 52000|
+-------+------+---+--------+------+

In [3]:
# get all data from employee table
run_query("select * from employee")

+-------+------+---+--------+------+
|   name|gender|age|    city|salary|
+-------+------+---+--------+------+
|  Alice|     F| 25|    pune| 60000|
|    Bob|     M| 30|  mumbai| 70000|
|Charlie|     M| 35|  mumbai| 80000|
|   Dave|     M| 40|    pune| 45000|
|    Eve|     F| 45|    pune| 52000|
|    Eve|     F| 45|banglore| 52000|
|    Eve|     F| 45| chennai| 52000|
+-------+------+---+--------+------+

In [4]:
# get all data from compnees table
run_query("select * from companies")

+---------+------+---------+-----+
|    cname|  city|employees|years|
+---------+------+---------+-----+
|Interface|  pune|      205|    1|
|  solsoft|mumbai|     3000|    9|
| infosoft|  pune|     6500|   15|
|   nosoft|  pune|    32000|   18|
|  prosoft|mumbai|       25|    1|
|  prosoft| noida|       25|    1|
|  prosoft| delhi|       25|    1|
+---------+------+---------+-----+

In [31]:
run_query("select * from employee where salary > 50000")

+-------+------+---+------+------+
|   name|gender|age|  city|salary|
+-------+------+---+------+------+
|  Alice|     F| 25|  pune| 60000|
|    Bob|     M| 30|mumbai| 70000|
|Charlie|     M| 35|mumbai| 80000|
|    Eve|     F| 45|  pune| 52000|
+-------+------+---+------+------+

In [32]:
run_query("select * from employee where salary > 50000 order by salary desc")

+-------+------+---+------+------+
|   name|gender|age|  city|salary|
+-------+------+---+------+------+
|Charlie|     M| 35|mumbai| 80000|
|    Bob|     M| 30|mumbai| 70000|
|  Alice|     F| 25|  pune| 60000|
|    Eve|     F| 45|  pune| 52000|
+-------+------+---+------+------+

In [34]:
run_query("select * from employee where name like 'A%' order by salary desc")

+-----+------+---+----+------+
| name|gender|age|city|salary|
+-----+------+---+----+------+
|Alice|     F| 25|pune| 60000|
+-----+------+---+----+------+

In [38]:
# get all data from employee table
run_query("select city, count(*) from employee group by city")

+------+--------+
|  city|count(1)|
+------+--------+
|  pune|       3|
|mumbai|       2|
+------+--------+

In [43]:
run_query('select city, avg(age)from employee group by city having avg(age)>32')

+------+------------------+
|  city|          avg(age)|
+------+------------------+
|  pune|36.666666666666664|
|mumbai|              32.5|
+------+------------------+

In [52]:
run_query("""select city cities, avg(age) avgage
    from employee ab
    group by city 
    having avg(age)>32
    order by 2 desc
    limit 1
    """)

+------+------------------+
|cities|            avgage|
+------+------------------+
|  pune|36.666666666666664|
+------+------------------+

#### Joins
##### inner: gets only matching records from both tables
##### left: gets all records from left table and matching records from right table
##### right: gets all records from right table and only matching records from left table
##### full: get all data from both table
##### cross: performs catesian product on both tables

In [53]:
run_query("select * from employee")

+-------+------+---+------+------+
|   name|gender|age|  city|salary|
+-------+------+---+------+------+
|  Alice|     F| 25|  pune| 60000|
|    Bob|     M| 30|mumbai| 70000|
|Charlie|     M| 35|mumbai| 80000|
|   Dave|     M| 40|  pune| 45000|
|    Eve|     F| 45|  pune| 52000|
+-------+------+---+------+------+

In [54]:
run_query("select * from companies")

+---------+------+---------+-----+
|    cname|  city|employees|years|
+---------+------+---------+-----+
|Interface|  pune|      205|    1|
|  solsoft|mumbai|     3000|    9|
| infosoft|  pune|     6500|   15|
|   nosoft|  pune|    32000|   18|
|  prosoft|mumbai|       25|    1|
+---------+------+---------+-----+

In [61]:
run_query("select count(*) from employee a inner join companies b on a.city=b.city")

+--------+
|count(1)|
+--------+
|      13|
+--------+

In [62]:
run_query("select count(*) from employee a left join companies b on a.city=b.city")

+--------+
|count(1)|
+--------+
|      15|
+--------+

In [63]:
run_query("select count(*) from employee a right join companies b on a.city=b.city")

+--------+
|count(1)|
+--------+
|      15|
+--------+

In [64]:
run_query("select count(*) from employee a full join companies b on a.city=b.city")

+--------+
|count(1)|
+--------+
|      17|
+--------+

In [71]:
run_query("""select *
        from employee a 
        left join companies b 
        on a.city=b.city
        where b.city is null
        """)

+----+------+---+--------+------+-----+----+---------+-----+
|name|gender|age|    city|salary|cname|city|employees|years|
+----+------+---+--------+------+-----+----+---------+-----+
| Eve|     F| 45|banglore| 52000| null|null|     null| null|
| Eve|     F| 45| chennai| 52000| null|null|     null| null|
+----+------+---+--------+------+-----+----+---------+-----+

In [73]:
run_query("select count(*) from employee a cross join companies b")

+--------+
|count(1)|
+--------+
|      49|
+--------+

### Set operations on tables
> Union

> Intersaction

> Union All

> minus

In [7]:
run_query("""select city, avg(salary) from employee group by city
            """)

+--------+------------------+
|    city|       avg(salary)|
+--------+------------------+
|    pune|52333.333333333336|
|  mumbai|           75000.0|
|banglore|           52000.0|
| chennai|           52000.0|
+--------+------------------+

In [8]:
run_query("""select city, avg(age) from employee group by city """)

+--------+------------------+
|    city|          avg(age)|
+--------+------------------+
|    pune|36.666666666666664|
|  mumbai|              32.5|
|banglore|              45.0|
| chennai|              45.0|
+--------+------------------+

In [12]:
run_query("""select city from employee group by city
           union
           select city from employee group by city""")

+--------+
|    city|
+--------+
|    pune|
|  mumbai|
|banglore|
| chennai|
+--------+

In [11]:
run_query("""select city from employee group by city
           union all
           select city from employee group by city""")

+--------+
|    city|
+--------+
|    pune|
|  mumbai|
|banglore|
| chennai|
|    pune|
|  mumbai|
|banglore|
| chennai|
+--------+

In [15]:
run_query("""select city from employee group by city
           intersect
           select city from employee group by city""")

+--------+
|    city|
+--------+
|    pune|
|  mumbai|
|banglore|
| chennai|
+--------+

In [16]:
run_query("""select city from employee group by city
           minus
           select city from employee group by city""")

+----+
|city|
+----+
+----+